Documents/Комментарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Комментарий</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКомментария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКомментариев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Комментарий/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Сотрудник = Константы.ТекущийПользователь.Получить();
	КонецЕсли;
	
	// 2017-04-28 МСН
	Если ТипЗнч(Параметры.Основание) = Тип("Структура") Тогда
		Если Параметры.Основание.Свойство("Контрагент") Тогда
			Объект.Контрагент = Параметры.Основание.Контрагент;
		КонецЕсли; 
		Если Параметры.Основание.Свойство("Посещение") Тогда
			Объект.Посещение = Параметры.Основание.Посещение;
		КонецЕсли; 
		Если Параметры.Основание.Свойство("ВидКомментария") Тогда
			Объект.ВидКомментария = Параметры.Основание.ВидКомментария;
			//ЗначениеВРеквизитФормы(Объект.ВидКомментария, "ВидКомментария");
		КонецЕсли;
		Если Параметры.Основание.Свойство("ВидЗадания") Тогда
			Объект.ВидЗадания = Параметры.Основание.ВидЗадания;
			//ЗначениеВРеквизитФормы(Объект.ВидКомментария, "ВидКомментария");
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("Ссылка") И ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.Комментарий") Тогда
		ЗначениеВРеквизитФормы(Параметры.Ссылка.ПолучитьОбъект(), "Объект");
	КонецЕсли;
	
	Если Объект.ВидЗадания = ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Мерчендайзинг") Тогда
		Элементы.ВидЗадания.Видимость = Истина;
		Элементы.ВидЗадания.Доступность = Ложь;
		Элементы.Комментарий.Видимость = Истина;
		Элементы.Комментарий.АктивизироватьПоУмолчанию = Истина;
		ЭтаФорма.ТекущийЭлемент = Элементы.Комментарий;
		//Элементы.ВидКомментария.Видимость = Ложь;
	ИначеЕсли Объект.ВидЗадания = ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("МаркетинговаяАктивность") Тогда
		Элементы.ВидЗадания.Видимость = Истина;
		Элементы.ВидЗадания.Доступность = Ложь;
		Элементы.Комментарий.Видимость = Истина;
		Элементы.Комментарий.АктивизироватьПоУмолчанию = Истина;
		ЭтаФорма.ТекущийЭлемент = Элементы.Комментарий;
		//Элементы.ВидКомментария.Видимость = Ложь;
	ИначеЕсли Объект.ВидЗадания = ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Комментарий") Тогда
		Элементы.ВидЗадания.Видимость = Истина;
		Элементы.ВидЗадания.Доступность = Ложь;
		Элементы.Комментарий.Видимость = Истина;
		Элементы.Комментарий.АктивизироватьПоУмолчанию = Истина;
		//Элементы.ВидКомментария.Видимость = Ложь;
	КонецЕсли; 
	
	//Если Не Элементы.ВидЗадания.Видимость Тогда
		ДополнительныеФункцииСервер.ПрисоединенныеФайлы_ИнициализироватьТаблицуПрисоединенныхФайлов(ЭтаФорма);
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщийМодульКлиент.ЗафиксироватьМестоположение(Объект.Ссылка, "Комментарий");
	
	Оповестить("УведомлениеОВыполненииЗаданияТП", , ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДополнительныеФункцииСервер.ПрисоединенныеФайлы_СохранитьПрисоединенныеФайлы(ЭтаФорма);
	
КонецПроцедуры

#ОБЛАСТЬ СОБЫТИЯФОРМЫ 

&НаКлиенте
Процедура ВидКомментарияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораСервер ();
КонецПроцедуры

&НаКлиенте
Процедура ВидКомментарияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораСервер();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСервер()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыКомментариев.Ссылка
	|ИЗ
	|	Справочник.ВидыКомментариев КАК ВидыКомментариев
	|ГДЕ
	|	НЕ ВидыКомментариев.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыКомментариев.Наименование";
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Элементы.ВидКомментария.СписокВыбора.ЗагрузитьЗначения(Рез);
КонецПроцедуры	

#КОНЕЦОБЛАСТИ

#ОБЛАСТЬ ПРИСОЕДИНЕННЫЕФАЙЛЫ

// ПОДКЛЮЧАЕМЫЕ ПРОЦЕДУРЫ //

&НаКлиенте
Процедура ДобавитьФайл()
	
	ПараметрыФайла = ДополнительныеФункцииКлиент.ПрисоединенныеФайлы_ДобавитьФайл(ЭтаФорма);
	
	Если ТипЗнч(ПараметрыФайла) = Тип("Структура") Тогда
		
		ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("ПутьКФайлу", ПараметрыФайла.ПутьКФайлу);
		ДопПараметры.Вставить("Расширение", ПараметрыФайла.Расширение);
		ДопПараметры.Вставить("Форма", ЭтаФорма);
						
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыИзображения", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("ОбщаяФорма.ФормаИзображения", Новый Структура("ПутьКФайлу", ПараметрыФайла.ПутьКФайлу),,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;	
		
КонецПроцедуры	



&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыИзображения(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ДополнительныеФункцииКлиент.ДобавитьФайлВТаблицуПрисоединенных(Результат, ДопПараметры);
		ОбновитьРеквизитыФормы();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьФайл()
	ДополнительныеФункцииКлиент.ПрисоединенныеФайлы_УдалитьФайл(ЭтаФорма);
	ОбновитьРеквизитыФормы();
КонецПроцедуры	

&НаСервере
Процедура ОбновитьРеквизитыФормы()  
	ДополнительныеФункцииСервер.ПрисоединенныеФайлы_ОбновитьРеквизитыФормы(ЭтаФорма);
	Модифицированность = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ВидКомментария) И Не Элементы.ВидЗадания.Видимость Тогда
		ПодключитьОбработчикОжидания("ДобавитьФайл", 0.1, Истина);
	ИначеЕсли Элементы.Комментарий.Видимость Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Комментарий;
	КонецЕсли;
	
	Если Объект.ВидЗадания = ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Мерчендайзинг") Тогда
		Элементы.ВидЗадания.Видимость = Истина;
		Элементы.ВидЗадания.Доступность = Ложь;
		Элементы.Комментарий.Видимость = Истина;
	ИначеЕсли Объект.ВидЗадания = ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("МаркетинговаяАктивность") Тогда
		Элементы.ВидЗадания.Видимость = Истина;
		Элементы.ВидЗадания.Доступность = Ложь;
		Элементы.Комментарий.Видимость = Истина;
	ИначеЕсли Объект.ВидЗадания = ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Комментарий") Тогда
		Элементы.ВидЗадания.Видимость = Истина;
		Элементы.ВидЗадания.Доступность = Ложь;
		Элементы.Комментарий.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	#ЕСЛИ МОБИЛЬНОЕПРИЛОЖЕНИЕКЛИЕНТ ТОГДА
		Если Элементы.ВидЗадания.Видимость Тогда
		ИначеЕсли ЭтаФорма.Таблица_ПрисоединенныеФайлы.Количество() = 0 Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(, "Сделайте фотографию!!");
		КонецЕсли;
	#КОНЕЦЕСЛИ
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	Всп = "";
КонецПроцедуры

&НаКлиенте
Процедура ПодгрузитьФото(Элемент, ТекущаяСтраница)
	
	ПодгрузитьФотоНаСервере(ТекущаяСтраница.Имя)
	
КонецПроцедуры

&НаСервере
Процедура ПодгрузитьФотоНаСервере(ТекущаяСтраницаИмя)
	
	ДополнительныеФункцииСервер.ПодгрузитьФотоНаСервере(ТекущаяСтраницаИмя, ЭтаФорма)
	
КонецПроцедуры

#КОНЕЦОБЛАСТИ
